In [1]:
import pandas as pd
import numpy as np

### Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [3]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated() #work for row

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### Transforming Data Using a Function or Mapping

In [6]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                    'Pastrami', 'corned beef', 'Bacon',
                    'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [7]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [8]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [9]:
lowercased = data['food'].str.lower()

In [10]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [11]:
data["animal"] = lowercased.map(meat_to_animal)

In [12]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [13]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [14]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [15]:
data.replace(-999,np.nan) #inlace = false

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [16]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [17]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [18]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [19]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [20]:
transform = lambda x: x[:4].upper()

In [21]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [22]:
data.index = data.index.map(transform)

In [23]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [24]:
# Easy use .rename()

In [25]:
data.rename(index=str.title,columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [26]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### Discretization and Binning

In [27]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [28]:
bins = [18, 25, 35, 60, 100]

In [29]:
cats = pd.cut(ages, bins)

In [30]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [31]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [32]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [33]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [34]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

#### You can read

### Detecting and Filtering Outliers

In [35]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [36]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.040923    -0.000568    -0.035946    -0.005740
std       1.020343     1.054534     0.995907     1.004274
min      -3.369516    -3.169690    -3.546111    -2.739804
25%      -0.705732    -0.706612    -0.744797    -0.691811
50%      -0.037731     0.008005    -0.088422    -0.004932
75%       0.676721     0.689653     0.575317     0.628119
max       3.055892     3.531277     3.176270     3.652571

In [37]:
data

            0         1         2         3
0   -0.075797  0.153991 -2.441064  0.988129
1   -1.248784 -0.592121 -0.209710  0.517293
2    1.270523  0.513989 -0.534845  0.927694
3    0.056837  0.940540  0.585122  0.565941
4   -0.892775  0.242992  0.965229  0.469121
..        ...       ...       ...       ...
995  0.623356 -0.152134 -0.490892  0.991544
996  0.242199 -1.413741 -0.391790  0.478020
997  0.775187 -0.023305  0.225173 -2.493338
998  2.317180 -0.023257  0.156752 -1.578615
999 -0.813259 -0.593139  0.396362  0.046211

[1000 rows x 4 columns]

In [38]:
data[np.abs(data[3])>3]

            0         1         2         3
481 -0.922220 -1.505694  0.465850  3.381981
632 -1.431552  1.343276 -0.208724  3.652571

In [39]:
data[(np.abs(data) > 3).any(1)] # Return whether any element is True, potentially over an axis.

            0         1         2         3
249  0.722881 -3.169690 -1.039737 -0.447067
291 -1.302158  3.531277 -0.716655 -1.194992
481 -0.922220 -1.505694  0.465850  3.381981
503 -0.227541 -3.117132 -0.425154  1.249289
512  3.055892  0.837506 -0.775478 -1.963180
582 -3.369516 -0.048320  0.596456  0.555439
632 -1.431552  1.343276 -0.208724  3.652571
712 -0.065505  3.381976  0.859083  1.481434
725 -2.016806 -1.396114 -3.546111 -0.089983
756  0.528299  0.761039  3.176270 -1.946265

In [40]:
data

            0         1         2         3
0   -0.075797  0.153991 -2.441064  0.988129
1   -1.248784 -0.592121 -0.209710  0.517293
2    1.270523  0.513989 -0.534845  0.927694
3    0.056837  0.940540  0.585122  0.565941
4   -0.892775  0.242992  0.965229  0.469121
..        ...       ...       ...       ...
995  0.623356 -0.152134 -0.490892  0.991544
996  0.242199 -1.413741 -0.391790  0.478020
997  0.775187 -0.023305  0.225173 -2.493338
998  2.317180 -0.023257  0.156752 -1.578615
999 -0.813259 -0.593139  0.396362  0.046211

[1000 rows x 4 columns]

In [41]:
np.sign(data)

       0    1    2    3
0   -1.0  1.0 -1.0  1.0
1   -1.0 -1.0 -1.0  1.0
2    1.0  1.0 -1.0  1.0
3    1.0  1.0  1.0  1.0
4   -1.0  1.0  1.0  1.0
..   ...  ...  ...  ...
995  1.0 -1.0 -1.0  1.0
996  1.0 -1.0 -1.0  1.0
997  1.0 -1.0  1.0 -1.0
998  1.0 -1.0  1.0 -1.0
999 -1.0 -1.0  1.0  1.0

[1000 rows x 4 columns]

In [42]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [43]:
data

            0         1         2         3
0   -0.075797  0.153991 -2.441064  0.988129
1   -1.248784 -0.592121 -0.209710  0.517293
2    1.270523  0.513989 -0.534845  0.927694
3    0.056837  0.940540  0.585122  0.565941
4   -0.892775  0.242992  0.965229  0.469121
..        ...       ...       ...       ...
995  0.623356 -0.152134 -0.490892  0.991544
996  0.242199 -1.413741 -0.391790  0.478020
997  0.775187 -0.023305  0.225173 -2.493338
998  2.317180 -0.023257  0.156752 -1.578615
999 -0.813259 -0.593139  0.396362  0.046211

[1000 rows x 4 columns]

### Permutation and Random Sampling

In [44]:
from numpy.random import permutation

In [45]:
df  = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [46]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [47]:
sampler = permutation(5)

In [48]:
sampler

array([2, 1, 0, 3, 4])

In [49]:
df.take(sampler) #iloc_based indexing

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [50]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [51]:
df.sample(n=3)
# Return a random sample of items from an axis of object

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3

### Computing Indicator / Dummy Variables

In [52]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
'data1': range(6)})

In [53]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [55]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

Another type of transformation for statistical modeling or machine learning applications
is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data‐
Frame with k columns containing all 1s and 0s. pandas has a get_dummies function
for doing this, though devising one yourself is not difficult. Let’s return to an earlier
example DataFrame

In [56]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [57]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [58]:
df_with_dummy = df[["data1"]].join(dummies)

In [59]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [60]:
# Oku çokkomelli